function LinksSection() {
  const sections = [
    {
      title: 'Решения',
      links: [
        'Печатная машина с фрикционным подающим механизмом',
        'Системы кодирования и маркировки для фармацевтики',
        'Промышленная печать на пластиковых бутылках',
        'Промышленная печать на стеклянных бутылках',
        'Системы кодирования и маркировки яиц'
      ]
    },
    {
      title: 'Продукты',
      links: ['Система массовой струйной печати', 'Кодировка мелкими символами', 'Кодировка крупными символами', 'Расходные материалы', 'Программное обеспечение']
    },
    {
      title: 'Поддержка',
      links: ['Техническая поддержка', 'Запланируйте виртуальную демонстрацию', 'Центр загрузки', 'Видео', 'Часто задаваемые вопросы', 'Карта сайта']
    },
    {
      title: 'Компания',
      links: ['О RN Mark', 'События', 'Дистрибьюторы', 'Брошюры о продукции', 'Блог']
    }
  ]

  return (
    <section className="links">
      <div className="container-li">
        {sections.map((section, idx) => (
          <div key={idx} className="sections">
            <h2>{section.title}</h2>
            <ul>
              {section.links.map((link, i) => (
                <li key={i}><a href="#">{link}</a></li>
              ))}
            </ul>
          </div>
        ))}
      </div>
    </section>
  )
}

export default LinksSection